//
//  MyStoryBook.swift
//  StoryBookGameApp
//
//  Created by Kamelia Toteva on 14.11.24.
//
import SwiftUI

let storyBook : StoryBook = StoryBook(scenes: [
    StoryBookScene(
        "Scene 0", //0
        "Пътешествията на Мики Маус в магическата гора",
        "Мики Маус изследва магическата гора, за да намери съкровището на желанията, преодолявайки предизвикателства и взимайки важни решения.",
        actions: [
            Action(description: "Започни приключението", next: 1)
        ]),
    StoryBookScene(
        "Scene 1", //1
        "Начало на Приключението",
        "Мики Маус пристига на входа на гората. Табела го предупреждава: „Само най-смелите могат да преминат.“ Той има две възможности:",
        actions: [
            Action(description: "Да влезе в гората с увереност", next: 2),
            Action(description: "Да потърси информация от местния мъдрец в селото", next: 3)
        ]),
    StoryBookScene(
        "Scene 2",//2
        "Среща с Вълшебните Гъби",
        "Мики забелязва кръг от светещи гъби. Една от тях проговаря и казва, че може да му даде сила или мъдрост. Мики трябва да избере:",
        actions: [
            Action(description: "Да избере силата", next: 5),
            Action(description: "Да избере мъдростта", next: 4)
        ]),
    StoryBookScene(
        "Scene 3",//3
        "Селският Мъдрец",
        "Мъдрецът казва на Мики за старите заклинания на гората и му дава вълшебен медальон, който да го пази от зли духове. След като се подготви, Мики влиза в гората.",
        actions: [
            Action(description: "Продължи", next: 5)
        ]),
    StoryBookScene(
        "Scene 4", //4
        "Пъзелът на Старата Фея",
        "Мики среща стара фея, която му предлага да му помогне, ако реши нейната загадка. Ако избере верния отговор, ще получи съкровен талисман, който ще го води по правилния път. Въпросът е колко измерна е магическата гора?",
        actions: [
            Action(description: "Четири измерна и толкова!", next: 6),
            Action(description: "Повече от 5 измерна гора, защото с магията всичко е възможно.", next: 7)
        ]),
    StoryBookScene(
        "Scene 5", //5
        "Среща със Злия Дракон",
        "Мики стига до пещера, където дракон пази входа към последната част на гората. Трябва да реши как да премине.",
        actions: [
            Action(description: "Да се бие с дракона", next: 8),
            Action(description: "Да използва медальона", next: 8)
        ]),
    StoryBookScene(
        "Scene 6", //6
        "Омагьосаното Езеро",
        "Мики вижда блестящо езеро, което му разкрива тайната на съкровището. То е скрито под Дървото на желанията в сърцето на гората.",
        actions: [
            Action(description: "Продължи към реката", next: 8)
        ]),
    StoryBookScene(
        "Scene 7", //7
        "Лабиринтът на Заблудата",
        "Мики се лута в лабиринта и среща дух на стар пътешественик, който му помага срещу малка услуга.",
        actions: [
            Action(description: "Продължи", next: 8)
        ]),
    StoryBookScene(
        "Scene 8",//8
        "Дървото на Желанията",
        "Мики стига до Дървото на желанията и трябва да избере своето желание.",
        actions: [
            Action(description: "Да пожелае съкровище", next: 9),
            Action(description: "Да пожелае приятелите му да са в безопасност", next: 10),
            Action(description: "Да избере приключенията да продължат", next: 11)
        ]),
    StoryBookScene(
        "Scene End 1", //9
        "Край: Съкровището на желанията",
        "Мики получава злато и скъпоценности, но остава в гората завинаги.",
        actions: [
            Action(description: "Започни отначало", next: 0)
        ]),
    StoryBookScene(
        "Scene End 2", //10
        "Край: Щастие и спокойствие",
        "Мики се завръща щастлив и с ново чувство на сила, знаейки, че приятелите му са в безопасност.",
        actions: [
            Action(description: "Започни отначало", next: 0)
        ]),
    StoryBookScene(
        "Scene End 3", //11
        "Край: Нова глава в приключенията",
        "Мики остава в гората и продължава с нови вълнуващи предизвикателства. Очаквай новите приключения на Мики в омагьосаната гора - част 2!",
        actions: [
            Action(description: "Започни отначало", next: 0)
        ]),
])
